{
  "photo_url": "hhkb-photo.jpg",
  "logo_url": "Evangelist-logo-light.png",
  "logo_link": "https://happyhackingkb.com/jp/evangelist/",
  "content_en": [
    {
      "tag": "span",
      "content": "I have been using the" 
    },
    {
      "tag": "a",
      "href": "https://happyhackingkb.com/",
      "content": "Happy Hacking Keyboard (HHKB)"
    },
    { "tag": "span",
      "content": "since 2018, on the recommendation of my friend, Hiroaki Yuda. I would not have tried it without his recommendation, because it looks so different from the Ten Keyless (TKL) keyboards I was used to. And it doesn't have arrow keys! I am really glad I tried this keyboard, however. The HHKB's layout is really  intuitive and it's 60 keys means you're fingers aren't moving across the board as much as with the bigger TKL size. Backspace is one row closer to the homerow, so its less of a reach for your pinkie for such a commonly used key. And Control is where Caps Lock usually is, I use Caps lock maybe once a week? This keyboard introduced me to the idea of function layers. In fact, that is how it provides arrow keys and Caps lock. At first glance, it seems those features aren't supported, but they're there, just under a function layer." 
    },
    { 
      "tag": "p",
      "content": "Getting to the customization side of HHKB, it offers 5 dip switches for you to toggle the behavior of the keyboard, and the newest models offer full key re-programability. I have switches 1 & 2 set  to Macintosh mode, which gives me media controls. I also set the fairly obvious dip switch 3 to  make Delete behave like Backspace. And I also set Dip Switch 4, turning my left control key into  a second function key. This lets me access a function key on both sides of the keyboard, and I just use the Command key on the right side of the spacebar for my Command key. Getting to the customization side of HHKB, it offers 5 dip switches for you to toggle the behavior of the keyboard, and the newest models offer full key re-programability. I have switches 1 & 2 set  to Macintosh mode, which gives me media controls. I also set the fairly obvious dip switch 3 to  make Delete behave like Backspace. And I also set Dip Switch 4, turning my left control key into  a second function key. This lets me access a function key on both sides of the keyboard, and I just use the Command key on the right side of the spacebar for my Command key." 
    },
    { 
      "tag": "p",
      "content": "Another great thing about the HHKB is that it uses Topre keyswitches. Those offer a premium feel and also make this keyboard compatidale with Realforce keyboards. Realforce boards come in different  dome weights and have a variety of keycap options. HHKB's come with 45g domes out of the box. After a few months of using 45g domes, I felt like my hands were getting too tired, so I bought a Realforce 30g board opened up both keyboards, voiding my warranty on both, and swapped the domes, giving me 30g in the HHKB." 
    },
    {
      "tag": "p",
      "content": "HHKB wouldn't be complete without Computer Accessories.I use their palm rest, keyboard bridge, keyboard roof, and transporter. They also make a vibration mat I am excited to try, and several more accessories. Indeed, the Ingenious keyboard layout designed by Wada sensei, the customization available with the Dip Switches and compatidibilty with other Topre boards, and the suite of accessories made by Bird make the HHKB life truly enjoyable."
    }
  ],
  "content_jp": []
}
